# SweepBaseVertOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SweepBaseVertOffset Property
ParameterTypeId Class See Also
---
"Vertical Profile Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SweepBaseVertOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SweepBaseVertOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SweepBaseVertOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace